<template>
  <div class="wrapper mt-5">
    <div class="container">
      <div class="grid d-flex justify-content-between flex-wrap">
        <tour-card
          v-for="card in cards"
          :key="card.id"
          classItem="item-wrapper d-flex flex-column mb-4"
          :card="card"
          @onNavigate="navigate"
        />
        <!-- /single-page -->
      </div>
    </div>
  </div>
</template> 

<script>
import TourCard from "@/components/TourCard.vue";

export default {
  components: { TourCard },
  computed: {
    cards() {
      return this.$store.getters["getCards"];
    },
  },
  methods: {
    navigate(id) {
      // console.log(id);
      this.$router.push({ name: "single", params: { id: id } });
    },
  },
  // data() {
  //   return {
  //     cards: [
  //       {
  //         id: 0,
  //         image: "mount.jpeg",
  //         title: "Новогодний Дагестан.",
  //         text: "Преимущество этого путешествия: отметим Новый год в теплой компании, на берегу Каспийского моря; гастрономические изыски – отведаем национальные блюда в лучших заведениях республики;быт и культура Северного Кавказа – посетим древнейшие города и селения, знаменитые мечети,музеи,боевые крепости и многое другое;побываем один из главных историко-культурных центров Дагестана – селение Ахты.",
  //         span: "Читать далее ...",
  //       },

  //       {
  //         id: 1,
  //         image: "2.jpg",
  //         title: "Новый год в Териберке на берегу океана",
  //         text: "Водопад и береговая батарея Подъём в 08:00.Завтрак в 09:00.Выход на маршрут в 10:00.Сегодня в программе пеший радиальный выход на северо-запад по побережью к териберскому водопадуи позициям артиллерийской береговой батареи времён Великой Отечественной войны.Возвращение в гостиницу к 16:00 – 17:00.Ужин около 18:00 В тёмное время суток будем охотиться за Полярным сиянием Протяженность: от 10 до 20 км пешком за день (на усмотрение гида и по согласования с участниками тура).Старая Териберка Подъём в 08:00.Завтрак в 09:00.Выход на маршрут в 10:00.Сегодня группу ждёт пеший радиальный выход на юго-восток по побережью, посещение губ Орловка  живо к полуострову. На  гр «стар досто к лаборы песчаные пляжиС 2свыб небесн светопредставлением.",
  //         span: "",
  //       },
  //       {
  //         id: 2,
  //         image: "elbrus.jpeg",
  //         title: "Восхождение на Эльбрус на Новый год.",
  //         text: "Первый день акклиматизации. Выход к водопаду «Девичьи Косы» иОбсерватории РАН Трансфер Пятигорск – пос. Терскол в 9 утра(ориентировочно 3-4 часа по горной дороге в Баксанское ущелье).Размещение в гостевом доме в пос. Терскол. Выход в высокогорнузону для акклиматизации. Подъем к водопаду «Девичьи Косы» далее (по самочувствию, погоде) к обсерватории РоссийскоАкадемии Наук (3000 метров). Путь проходит через сосновый лес,базальтовые скульптуры – отличные места для фотосъемки. Решенио маршруте принимается гидом в зависимости от состояния самогомаршрута, прогноза погоды, самочувствия группы. Налюбовавшисьпрекрасными видами – спускаемся в Терскол. Ужин. Ночевка вгостевом доме в поселке Терскол. Подъем на склоны г.Чегет-Тау-Чана (в простонародье — Чегет) до высоты — 3000 метровГрамотная акклиматизация – залог успешного восхождения, поэтомусегодня продолжаем подъем. После завтрака, поднимаемся на склоныгоры Чегет для высоты 3000 метров. Поднявшись наверх, мы увидимЗападную и Восточную вершины Эльбруса, а также весь маршрувосхождения. Здесь – станция Чегетской канатной дороги и кафе«Ай», где можно отведать блюда национальной кухни, горный чай знаменитые пирожки с мясом и брусникой. На подъеме рекомендуетсяне пользоваться подъемниками, т.к. лучшие результаты достигаютсяпри физической нагрузке. После прогулки и обеда, ваш горный гидпоможет разобраться с необходимым снаряжением для подъема нагору.",
  //         span: "",
  //       },
  //       {
  //         id: 3,
  //         image: "crimea.jpeg",
  //         title: "Праздничный Крым. Новый год в Севастополе.",
  //         text: "Встреча группы. Экскурсия по Бахчисараю. Празднование Новогогода в Севастополе Встреча гостей: на ж/д вокзале г. Симферополс 10:00 до 10:30 (внутренний дворик вокзала, возле фонтана«Голуби»); в аэропорту г. Симферополя с 11:30 до 12:00 (справот выхода из здания терминала (снаружи здания), над выходом наружная надпись: «Симферополь»). Трансфер в Бахчисарай –историческую столицу Крымского ханства, расположенную окруженной Крымскими горами живописной долине реки Чуру Обед (с элементами крымско-татарской кухни) и дегустацикрымских вин разных марок. Знакомство с дворцовым комплексомХанского дворца – резиденцией династии Гиреев и единственным вмире образцом крымско-татарской архитектуры и быта: дворцоваямечеть, зал Совета и Суда, гарем, прославленный Пушкиным Фонтанслез, Золотой фонтан, Персидский дворик. По желанию, на выбор,предлагаем посетить (доп.платпроведения факультативных экскурсий туристы самостоятельно):музей с мини-зоопарком «Крым на ладони» – самый большой в Крымупарк миниатюр, где собраны все историко-культурные иархитектурные достопримечательности полуострова; Свято-Успенский пещерный монастырь и святой источник в ущелье Марьям-Дере(самостоятельно); кофейню-музей «Дегирмен», где вы увидите макетдревнего Бахчисарая, который оживает благодаря эффектам света извука, а также попробовать вкуснейший восточный кофе. Переезд вСевастополь через Инкерман, путевая информация о Свято-Климентском пещерном монастыре и обзор средневековокрепости Каламита. Размещение в одной из гостиниц города.Празднование Нового года в обстановке уличного гулянья в центре Севастополя на площади Нахимова (самостоятельно).",
  //         span: "",
  //       },
  //       {
  //         id: 4,
  //         image: "polar.jpg",
  //         title: "Три дня за Полярным кругом.",
  //         text: `Мурманск, охота за северным сиянием (с сентября по апрель)
  //                               Завтрак в отеле для проживающих в отеле по программе. 09:00
  //                               Встреча с группой у отеля «Меридиан» на площади Пять Углов.
  //                               Заезд в отель «Огни Мурманска». Переезд в поселок Териберка. Мы
  //                               на целый день уедем в уже ставшую легендой Териберку. Магическая
  //                               красота здешних мест завораживает любого путника. Экскурсия на
  //                               водопад, каменный пляж «яйца драконов» (подвозка на снегоходе к
  //                               месту начала экскурсии с декабря по апрель). Путешествие в
  //                               северную сказку, где старые корабли видят сны о прошлом, водопад
  //                               сверкает застывшими льдами, а пляж из «яиц драконов» поражает
  //                               своим размахом. Мистические камни-сейды молчаливо хранят
  //                               тысячелетние тайны, а взору предстают неповторимые и
  //                               удивительные пейзажи! Обед традиционной кухни в ресторане.
  //                               Свободное время. Возвращение в Мурманск. Трансфер к отелям «Огни
  //                               Мурманска», «Меридиан». Отдых.`,
  //         span: "",
  //       },
  //       {
  //         id: 5,
  //         image: "altay.jpg",
  //         title: "Зимний Алтай",
  //         text: `Зубрятник – Камышлинский водопад Завтрак в кафе «Таежник» После
  //                               завтрака выезд на экскурсию. Первым объектом посещения станет
  //                               территория всесезонного курорта «Манжерок». Посещение
  //                               Манжерокского озера, которое находится недалеко от села
  //                               Манжерок, у подножья гор Синюха и Малая Синюха. Затем на
  //                               гондольном подъемнике подниметесь на обзорную площадку горы
  //                               Синюха, откуда открывается красивая панорама долины реки Катунь.
  //                               Переезд до зубрятника, где есть возможность полюбоваться
  //                               грациозными маралами и величественными, суровыми зубрами. Обед в
  //                               кафе на территории туркомплекса “Берендеевка” Переезд до
  //                               с.Барангол. Пешая экскурсия на Камышлинский водопад. Возвращение
  //                               в «Таежник». Ужин. Вечером Мастер-класс по завариванию
  //                               Алтайского чая и приготовлению алтайских сладостей ток-чок.
  //                               Протяженность: на авто – 50 км, пешком – 5 км.`,
  //         span: "",
  //       },
  //     ],
  //   };
  // },
};
</script>